{"meals":{"meals":[{"id":386997,"imageType":"jpg","readyInMinutes":50,"servings":15,"sourceUrl":"http://www.tasteofhome.com/recipes/banana-fudge-cake","title":"Banana Fudge Cake"},{"id":9563,"imageType":"jpg","readyInMinutes":25,"servings":5,"sourceUrl":"http://www.myrecipes.com/recipe/beet-goat-cheese-crostini-10000000424539/","title":"Beet-and-Goat Cheese Crostini"},{"id":715563,"imageType":"jpg","readyInMinutes":45,"servings":4,"sourceUrl":"https://spoonacular.com/pierogi-casserole-715563","title":"Pierogi Casserole"}],"nutrients":{"calories":1856.54,"carbohydrates":265.72,"fat":66.62,"protein":52.82}},"summary":[{"id":386997,"summary":"If you want to add more <b>lacto ovo vegetarian</b> recipes to your collection, Banana Fudge Cake might be a recipe you should try. This recipe serves 15 and costs 62 cents per serving. This hor d'oeuvre has <b>329 calories</b>, <b>2g of protein</b>, and <b>7g of fat</b> per serving. 2 people found this recipe to be flavorful and satisfying. This recipe from Taste of Home requires baking cocoa, water, butter, and gf chocolate cake mix. From preparation to the plate, this recipe takes approximately <b>50 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 7%</b>. This score is improvable. Try <a href=\"https://spoonacular.com/recipes/banana-cake-with-fudge-frosting-170352\">Banana Cake with Fudge Frosting</a>, <a href=\"https://spoonacular.com/recipes/almond-fudge-banana-cake-125661\">Almond Fudge Banana Cake</a>, and <a href=\"https://spoonacular.com/recipes/banana-chocolate-fudge-layer-cake-light-125412\">Banana Chocolate Fudge Layer Cake (Light)</a> for similar recipes.","title":"Banana Fudge Cake"},{"id":9563,"summary":"The recipe Beet-and-Goat Cheese Crostini can be made <b>in around 25 minutes</b>. For <b>$4.26 per serving</b>, this recipe <b>covers 25%</b> of your daily requirements of vitamins and minerals. One serving contains <b>666 calories</b>, <b>21g of protein</b>, and <b>27g of fat</b>. This recipe serves 5. Head to the store and pick up goat cheese, honey, white balsamic vinegar, and a few other things to make it today. It works well as a pretty expensive main course. 1 person were impressed by this recipe. It is a good option if you're following a <b>lacto ovo vegetarian</b> diet. Not a lot of people really liked this Mediterranean dish. It is brought to you by My Recipes. With a spoonacular <b>score of 71%</b>, this dish is solid. Similar recipes are <a href=\"https://spoonacular.com/recipes/roasted-beet-and-goat-cheese-crostini-688968\">Roasted Beet and Goat Cheese Crostini</a>, <a href=\"https://spoonacular.com/recipes/goat-cheese-crostini-with-watermelon-beet-salsa-1255163\">Goat Cheese Crostini with Watermelon-Beet Salsa</a>, and <a href=\"https://spoonacular.com/recipes/goat-cheese-crostini-with-watermelon-beet-salsa-794879\">Goat Cheese Crostini with Watermelon-Beet Salsa</a>.","title":"Beet-and-Goat Cheese Crostini"},{"id":715563,"summary":"If you want to add more <b>Eastern European</b> recipes to your recipe box, Pierogi Casserole might be a recipe you should try. This main course has <b>844 calories</b>, <b>31g of protein</b>, and <b>32g of fat</b> per serving. This recipe serves 4 and costs $1.55 per serving. It can be enjoyed any time, but it is especially good for <b>Autumn</b>. 1544 people have made this recipe and would make it again. If you have butter, white potatoes, sharp cheddar cheese, and a few other ingredients on hand, you can make it. It is a good option if you're following a <b>lacto ovo vegetarian</b> diet. From preparation to the plate, this recipe takes around <b>45 minutes</b>. It is brought to you by Pink When. Overall, this recipe earns an <b>amazing spoonacular score of 90%</b>. Try <a href=\"https://spoonacular.com/recipes/pierogi-casserole-1249305\">Pierogi Casserole</a>, <a href=\"https://spoonacular.com/recipes/easy-pierogi-casserole-1196331\">Easy \"Pierogi\" Casserole</a>, and <a href=\"https://spoonacular.com/recipes/kluski-pierogi-casserole-93276\">Kluski-Pierogi Casserole</a> for similar recipes.","title":"Pierogi Casserole"}]}
