{"meals":{"meals":[{"id":1697711,"imageType":"jpg","readyInMinutes":45,"servings":2,"sourceUrl":"https://spoonacular.com/applesauce-apple-butter-your-for-the-beginning-of-fall-1697711","title":"Applesauce & Apple Butter - Your for the Beginning of Fall"},{"id":1148986,"imageType":"jpg","readyInMinutes":30,"servings":2,"sourceUrl":"https://fitfoodiefinds.com/butternut-squash-egg-in-a-frame/","title":"Butternut Squash Egg in a Frame"},{"id":470653,"imageType":"jpg","readyInMinutes":260,"servings":4,"sourceUrl":"http://www.seriouseats.com/recipes/2014/03/pork-carnitas-oaxaca-cheese-shooters-sandwich-food-lab-recipe.html","title":"Pork Carnitas and Oaxaca Cheese Shooter's-Sandwich With Spicy Refried Beans and Pickled Red Onions"}],"nutrients":{"calories":1919.61,"carbohydrates":279.0,"fat":73.84,"protein":49.31}},"summary":[{"id":1697711,"summary":"Applesauce & Apple Butter - Your for the Beginning of Fall is a <b>gluten free, dairy free, lacto ovo vegetarian, and vegan</b> condiment. This recipe serves 2 and costs $2.68 per serving. One serving contains <b>676 calories</b>, <b>2g of protein</b>, and <b>1g of fat</b>. <b>Autumn</b> will be even more special with this recipe. A mixture of apples, lemon juice, sugar, and a handful of other ingredients are all it takes to make this recipe so flavorful. It is brought to you by spoonacular user <a href=\"/profile/maplewoodroad\">maplewoodroad</a>. From preparation to the plate, this recipe takes approximately <b>45 minutes</b>. Users who liked this recipe also liked <a href=\"https://spoonacular.com/recipes/oven-roasted-applesauce-and-apple-butter-47993\">Oven-roasted Applesauce And Apple Butter</a>, <a href=\"https://spoonacular.com/recipes/fall-pumpkin-apple-butter-crockpot-104182\">Fall Pumpkin Apple Butter Crockpot</a>, and <a href=\"https://spoonacular.com/recipes/apple-butter-grilled-cheese-little-bites-of-fall-580459\">Apple Butter Grilled Cheese: Little Bites of Fall</a>.","title":"Applesauce & Apple Butter - Your for the Beginning of Fall"},{"id":1148986,"summary":"Butternut Squash Egg in a Frame might be a good recipe to expand your main course repertoire. One portion of this dish contains approximately <b>15g of protein</b>, <b>13g of fat</b>, and a total of <b>268 calories</b>. For <b>$1.3 per serving</b>, this recipe <b>covers 27%</b> of your daily requirements of vitamins and minerals. This recipe serves 2. It is a good option if you're following a <b>gluten free, dairy free, paleolithic, and lacto ovo vegetarian</b> diet. 1 person has made this recipe and would make it again. This recipe from Fit Foodie Finds requires butternut squash, avocado oil, eggs, and bell pepper. From preparation to the plate, this recipe takes around <b>30 minutes</b>. Overall, this recipe earns a <b>good spoonacular score of 67%</b>. If you like this recipe, you might also like recipes such as <a href=\"https://spoonacular.com/recipes/egg-in-a-frame-763759\">Egg in a Frame</a>, <a href=\"https://spoonacular.com/recipes/fried-egg-and-butternut-squash-tartine-479761\">Fried Egg and Butternut Squash Tartine</a>, and <a href=\"https://spoonacular.com/recipes/turkey-and-kale-butternut-squash-egg-muffins-1384943\">Turkey and Kale Butternut Squash Egg Muffins</a>.","title":"Butternut Squash Egg in a Frame"},{"id":470653,"summary":"Pork Carnitas and Oaxaca Cheese Shooter's-Sandwich With Spicy Refried Beans and Pickled Red Onions is a main course that serves 4. One portion of this dish contains approximately <b>33g of protein</b>, <b>59g of fat</b>, and a total of <b>973 calories</b>. For <b>$2.38 per serving</b>, this recipe <b>covers 19%</b> of your daily requirements of vitamins and minerals. From preparation to the plate, this recipe takes approximately <b>4 hours and 20 minutes</b>. This recipe from Serious Eats has 1 fans. A mixture of rustic bread, onions, refried beans, and a handful of other ingredients are all it takes to make this recipe so tasty. It is a good option if you're following a <b>lacto ovo vegetarian</b> diet. With a spoonacular <b>score of 39%</b>, this dish is not so awesome. Similar recipes include <a href=\"https://spoonacular.com/recipes/oaxaca-burger-with-manchego-avocado-and-pickled-habanero-onions-315037\">Oaxaca Burger with Manchego, Avocado and Pickled Habanero Onions</a>, <a href=\"https://spoonacular.com/recipes/roast-duck-shooters-style-sandwich-with-pickled-carrots-daikon-cucumber-and-hoisin-sauce-470652\">Roast Duck Shooter's-Style Sandwich With Pickled Carrots, Daikon, Cucumber, and Hoisin Sauce</a>, and <a href=\"https://spoonacular.com/recipes/loaded-vegetarian-tortas-with-avocados-queso-oaxaca-black-beans-and-pickled-jalapeo-195289\">Loaded Vegetarian Tortas With Avocados, Queso Oaxaca, Black Beans, and Pickled Jalapeño</a>.","title":"Pork Carnitas and Oaxaca Cheese Shooter's-Sandwich With Spicy Refried Beans and Pickled Red Onions"}]}
