{"meals":{"meals":[{"id":247083,"imageType":"jpg","readyInMinutes":45,"servings":4,"sourceUrl":"https://www.simplyrecipes.com/recipes/butterscotch_pudding/","title":"Butterscotch Pudding"},{"id":565008,"imageType":"jpg","readyInMinutes":25,"servings":2,"sourceUrl":"http://www.noobcook.com/baked-cheesy-bolognese-pasta/2/","title":"Baked Cheesy Bolognese Pasta"},{"id":633839,"imageType":"jpg","readyInMinutes":45,"servings":1,"sourceUrl":"https://spoonacular.com/baked-sweet-potato-fries-with-yogurt-and-chipotle-pepper-633839","title":"Baked Sweet Potato Fries With Yogurt and Chipotle Pepper"}],"nutrients":{"calories":1939.0,"carbohydrates":284.93,"fat":66.69,"protein":52.0}},"summary":[{"id":247083,"summary":"Butterscotch Pudding is a <b>gluten free and lacto ovo vegetarian</b> recipe with 4 servings. One serving contains <b>706 calories</b>, <b>5g of protein</b>, and <b>38g of fat</b>. For <b>$1.34 per serving</b>, this recipe <b>covers 8%</b> of your daily requirements of vitamins and minerals. It is brought to you by Simply Recipes. If you have heavy whipping cream, egg yolks, kosher salt, and a few other ingredients on hand, you can make it. It works well as an affordable dessert. 696 people were impressed by this recipe. From preparation to the plate, this recipe takes roughly <b>45 minutes</b>. Overall, this recipe earns an <b>improvable spoonacular score of 0%</b>. If you like this recipe, you might also like recipes such as <a href=\"https://spoonacular.com/recipes/best-butterscotch-pudding-508102\">Best Butterscotch Pudding</a>, <a href=\"https://spoonacular.com/recipes/butterscotch-pudding-77694\">Butterscotch Pudding</a>, and <a href=\"https://spoonacular.com/recipes/butterscotch-pudding-346913\">Butterscotch Pudding</a>.","title":"Butterscotch Pudding"},{"id":565008,"summary":"Baked Cheesy Bolognese Pasta might be a good recipe to expand your main course recipe box. This recipe makes 2 servings with <b>594 calories</b>, <b>19g of protein</b>, and <b>13g of fat</b> each. For <b>$1.48 per serving</b>, this recipe <b>covers 15%</b> of your daily requirements of vitamins and minerals. A mixture of dried parsley flakes, water, penne, and a handful of other ingredients are all it takes to make this recipe so tasty. 2 people found this recipe to be yummy and satisfying. From preparation to the plate, this recipe takes about <b>25 minutes</b>. It is a good option if you're following a <b>lacto ovo vegetarian</b> diet. It is brought to you by Noob Cook. With a spoonacular <b>score of 43%</b>, this dish is good. If you like this recipe, take a look at these similar recipes: <a href=\"https://spoonacular.com/recipes/cheesy-baked-pasta-with-cauliflower-982568\">Cheesy Baked Pasta with Cauliflower</a>, <a href=\"https://spoonacular.com/recipes/cheesy-baked-pasta-with-cauliflower-1351821\">Cheesy Baked Pasta with Cauliflower</a>, and <a href=\"https://spoonacular.com/recipes/cheesy-turkey-baked-pasta-1215223\">Cheesy Turkey Baked Pasta</a>.","title":"Baked Cheesy Bolognese Pasta"},{"id":633839,"summary":"Baked Sweet Potato Fries With Yogurt and Chipotle Pepper might be just the <b>American</b> recipe you are searching for. For <b>$2.44 per serving</b>, you get a main course that serves 1. One portion of this dish contains around <b>28g of protein</b>, <b>15g of fat</b>, and a total of <b>644 calories</b>. 1 person found this recipe to be yummy and satisfying. Head to the store and pick up roasted pepitas, sea salt, plain greek yogurt, and a few other things to make it today. From preparation to the plate, this recipe takes about <b>45 minutes</b>. It is a good option if you're following a <b>gluten free and lacto ovo vegetarian</b> diet. It is brought to you by Foodista. With a spoonacular <b>score of 72%</b>, this dish is solid. Try <a href=\"https://spoonacular.com/recipes/chili-spiced-sweet-potato-fries-and-chipotle-yogurt-dip-power-foods-474557\">Chili Spiced Sweet Potato Fries and Chipotle Yogurt Dip (Power Foods)</a>, <a href=\"https://spoonacular.com/recipes/baked-chipotle-sweet-potato-fries-45068\">Baked Chipotle Sweet Potato Fries</a>, and <a href=\"https://spoonacular.com/recipes/baked-chipotle-sweet-potato-fries-44290\">Baked Chipotle Sweet Potato Fries</a> for similar recipes.","title":"Baked Sweet Potato Fries With Yogurt and Chipotle Pepper"}]}
